
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_managed_disk.shared_disk
* Update
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]
  * module.darts_redis.azurerm_redis_cache.redis
  * module.sa.azurerm_storage_account.storage_account
* Delete
  * module.sa_dets[0].azurerm_private_endpoint.this[0]
  * module.sa_dets[0].azurerm_storage_account.storage_account
  * module.sa_dets[0].random_string.storage_account_random_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_managed_disk.shared_disk will be created
  + resource "azurerm_managed_disk" "shared_disk" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1999
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = 5
      + name                              = "shared-disk"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "darts-migration-stg-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Premium_LRS"
      + tier                              = (known after apply)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.darts_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Cache/redis/darts-stg"
        name                               = "darts-stg"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
            # (16 unchanged attributes hidden)
        }
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/dartssastg"
        name                               = "dartssastg"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_dets[0].azurerm_private_endpoint.this[0] will be destroyed
  # (because azurerm_private_endpoint.this is not in configuration)
  - resource "azurerm_private_endpoint" "this" {
      - custom_dns_configs            = [] -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/privateEndpoints/sastgdartsartefacts" -> null
      - location                      = "uksouth" -> null
      - name                          = "sastgdartsartefacts" -> null
      - network_interface             = [
          - {
              - id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/networkInterfaces/sastgdartsartefacts.nic.4bf3e642-f93f-4e54-a40d-c67927d612fc"
              - name = "sastgdartsartefacts.nic.4bf3e642-f93f-4e54-a40d-c67927d612fc"
            },
        ] -> null
      - private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/privateEndpoints/sastgdartsartefacts/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "sastgdartsartefacts.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.148.36.8",
                        ]
                      - name         = "sastgdartsartefacts"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name           = "darts-migration-stg-rg" -> null
      - subnet_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/private-endpoints" -> null
      - tags                          = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null
        # (1 unchanged attribute hidden)

      - private_dns_zone_group {
          - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/privateEndpoints/sastgdartsartefacts/privateDnsZoneGroups/endpoint-dnszonegroup" -> null
          - name                 = "endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection              = false -> null
          - name                              = "sastgdartsartefacts" -> null
          - private_connection_resource_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsartefacts" -> null
          - private_ip_address                = "10.148.36.8" -> null
          - subresource_names                 = [
              - "blob",
            ] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.sa_dets[0].azurerm_storage_account.storage_account will be destroyed
  # (because azurerm_storage_account.storage_account is not in configuration)
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                        = "Cool" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "RAGRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsartefacts" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "sastgdartsartefacts" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://sastgdartsartefacts.blob.core.windows.net/" -> null
      - primary_blob_host                  = "sastgdartsartefacts.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://sastgdartsartefacts.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "sastgdartsartefacts.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://sastgdartsartefacts.file.core.windows.net/" -> null
      - primary_file_host                  = "sastgdartsartefacts.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://sastgdartsartefacts.queue.core.windows.net/" -> null
      - primary_queue_host                 = "sastgdartsartefacts.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://sastgdartsartefacts.table.core.windows.net/" -> null
      - primary_table_host                 = "sastgdartsartefacts.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://sastgdartsartefacts.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "sastgdartsartefacts.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "darts-migration-stg-rg" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_blob_connection_string   = (sensitive value) -> null
      - secondary_blob_endpoint            = "https://sastgdartsartefacts-secondary.blob.core.windows.net/" -> null
      - secondary_blob_host                = "sastgdartsartefacts-secondary.blob.core.windows.net" -> null
      - secondary_connection_string        = (sensitive value) -> null
      - secondary_dfs_endpoint             = "https://sastgdartsartefacts-secondary.dfs.core.windows.net/" -> null
      - secondary_dfs_host                 = "sastgdartsartefacts-secondary.dfs.core.windows.net" -> null
      - secondary_location                 = "ukwest" -> null
      - secondary_queue_endpoint           = "https://sastgdartsartefacts-secondary.queue.core.windows.net/" -> null
      - secondary_queue_host               = "sastgdartsartefacts-secondary.queue.core.windows.net" -> null
      - secondary_table_endpoint           = "https://sastgdartsartefacts-secondary.table.core.windows.net/" -> null
      - secondary_table_host               = "sastgdartsartefacts-secondary.table.core.windows.net" -> null
      - secondary_web_endpoint             = "https://sastgdartsartefacts-secondary.z33.web.core.windows.net/" -> null
      - secondary_web_host                 = "sastgdartsartefacts-secondary.z33.web.core.windows.net" -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null
        # (44 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = true -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)

          - container_delete_retention_policy {
              - days = 7 -> null
            }

          - delete_retention_policy {
              - days                     = 365 -> null
              - permanent_delete_enabled = false -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
            ] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.sa_dets[0].random_string.storage_account_random_string will be destroyed
  # (because random_string.storage_account_random_string is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "jdmvndo0som2mwmy2tmiufmt" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "jdmvndo0som2mwmy2tmiufmt" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 1 to add, 3 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":333,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->